/* eslint-disable no-magic-numbers, max-len */
// Copied from https://raw.githubusercontent.com/bl00mber/react-phone-input-2/master/src/rawCountries.js

// Country model:
// [
//    Country name,
//    Regions,
//    iso2 code,
//    International dial code,
//    Format (if available),
//    Order (if >1 country with same dial code),
//    Area codes (if >1 country with same dial code)
// ]
//
// Regions:
// ['america', 'europe', 'asia', 'oceania', 'africa']
//
// Sub-regions:
// ['north-america', 'south-america', 'central-america', 'carribean',
//  'eu-union', 'ex-ussr', 'ex-yugos', 'baltic', 'middle-east', 'north-africa']

const rawCountries = [
    [
        'Соединенные Штаты',
        [ 'america', 'north-america' ],
        'us',
        '1',
        '+. (...) ...-....',
        0,
        [ '907', '205', '251', '256', '334', '479', '501', '870', '480', '520', '602', '623', '928', '209', '213', '310', '323', '408', '415', '510', '530', '559', '562', '619', '626', '650', '661', '707', '714', '760', '805', '818', '831', '858', '909', '916', '925', '949', '951', '303', '719', '970', '203', '860', '202', '302', '239', '305', '321', '352', '386', '407', '561', '727', '772', '813', '850', '863', '904', '941', '954', '229', '404', '478', '706', '770', '912', '808', '319', '515', '563', '641', '712', '208', '217', '309', '312', '618', '630', '708', '773', '815', '847', '219', '260', '317', '574', '765', '812', '316', '620', '785', '913', '270', '502', '606', '859', '225', '318', '337', '504', '985', '413', '508', '617', '781', '978', '301', '410', '207', '231', '248', '269', '313', '517', '586', '616', '734', '810', '906', '989', '218', '320', '507', '612', '651', '763', '952', '314', '417', '573', '636', '660', '816', '228', '601', '662', '406', '252', '336', '704', '828', '910', '919', '701', '308', '402', '603', '201', '609', '732', '856', '908', '973', '505', '575', '702', '775', '212', '315', '516', '518', '585', '607', '631', '716', '718', '845', '914', '216', '330', '419', '440', '513', '614', '740', '937', '405', '580', '918', '503', '541', '215', '412', '570', '610', '717', '724', '814', '401', '803', '843', '864', '605', '423', '615', '731', '865', '901', '931', '210', '214', '254', '281', '325', '361', '409', '432', '512', '713', '806', '817', '830', '903', '915', '936', '940', '956', '972', '979', '435', '801', '276', '434', '540', '703', '757', '804', '802', '206', '253', '360', '425', '509', '262', '414', '608', '715', '920', '304', '307' ]
    ],
    [
        'Канада',
        [ 'america', 'north-america' ],
        'ca',
        '1',
        '+. (...) ...-....',
        1,
        [ '204', '226', '236', '249', '250', '289', '306', '343', '365', '387', '403', '416', '418', '431', '437', '438', '450', '506', '514', '519', '548', '579', '581', '587', '604', '613', '639', '647', '672', '705', '709', '742', '778', '780', '782', '807', '819', '825', '867', '873', '902', '905' ]
    ],
    [
        'Великобритания',
        [ 'europe', 'eu-union' ],
        'gb',
        '44',
        '+.. .... ......'
    ],
    [
        'Афганистан',
        [ 'asia' ],
        'af',
        '93'
    ],
    [
        'Албания',
        [ 'europe' ],
        'al',
        '355'
    ],
    [
        'Алжир',
        [ 'africa', 'north-africa' ],
        'dz',
        '213'
    ],
    [
        'Американское Самоа',
        [ 'oceania' ],
        'as',
        '1684'
    ],
    [
        'Андорра',
        [ 'europe' ],
        'ad',
        '376'
    ],
    [
        'Ангола',
        [ 'africa' ],
        'ao',
        '244'
    ],
    [
        'Ангилья',
        [ 'america', 'carribean' ],
        'ai',
        '1264'
    ],
    [
        'Антигуа и Барбуда',
        [ 'america', 'carribean' ],
        'ag',
        '1268'
    ],
    [
        'Аргентина',
        [ 'america', 'south-america' ],
        'ar',
        '54',
        '+.. (..) ........'
    ],
    [
        'Армения',
        [ 'asia', 'ex-ussr' ],
        'am',
        '374'
    ],
    [
        'Аруба',
        [ 'america', 'carribean' ],
        'aw',
        '297'
    ],
    [
        'Австралия',
        [ 'oceania' ],
        'au',
        '61',
        '+.. ... ... ...'
    ],
    [
        'Австрия',
        [ 'europe', 'eu-union' ],
        'at',
        '43'
    ],
    [
        'Азербайджан',
        [ 'asia', 'ex-ussr' ],
        'az',
        '994'
    ],
    [
        'Багамские о-ва',
        [ 'america', 'carribean' ],
        'bs',
        '1242'
    ],
    [
        'Бахрейн',
        [ 'middle-east' ],
        'bh',
        '973'
    ],
    [
        'Бангладеш',
        [ 'asia' ],
        'bd',
        '880'
    ],
    [
        'Барбадос',
        [ 'america', 'carribean' ],
        'bb',
        '1246'
    ],
    [
        'Беларусь',
        [ 'europe', 'ex-ussr' ],
        'by',
        '375',
        '+... (..) ... .. ..'
    ],
    [
        'Бельгия',
        [ 'europe', 'eu-union' ],
        'be',
        '32',
        '+.. ... .. .. ..'
    ],
    [
        'Белиз',
        [ 'america', 'central-america' ],
        'bz',
        '501'
    ],
    [
        'Бенин',
        [ 'africa' ],
        'bj',
        '229'
    ],
    [
        'Бермудские острова',
        [ 'america', 'north-america' ],
        'bm',
        '1441'
    ],
    [
        'Бутан',
        [ 'asia' ],
        'bt',
        '975'
    ],
    [
        'Боливия',
        [ 'america', 'south-america' ],
        'bo',
        '591'
    ],
    [
        'Босния и Герцеговина',
        [ 'europe', 'ex-yugos' ],
        'ba',
        '387'
    ],
    [
        'Ботсвана',
        [ 'africa' ],
        'bw',
        '267'
    ],
    [
        'Бразилия',
        [ 'america', 'south-america' ],
        'br',
        '55',
        '+.. (..) .........'
    ],
    [
        'Британская территория Индийского океана',
        [ 'asia' ],
        'io',
        '246'
    ],
    [
        'Британские Виргинские острова',
        [ 'america', 'carribean' ],
        'vg',
        '1284'
    ],
    [
        'Бруней',
        [ 'asia' ],
        'bn',
        '673'
    ],
    [
        'Болгария',
        [ 'europe', 'eu-union' ],
        'bg',
        '359'
    ],
    [
        'Буркина-Фасо',
        [ 'africa' ],
        'bf',
        '226'
    ],
    [
        'Бурунди',
        [ 'africa' ],
        'bi',
        '257'
    ],
    [
        'Камбоджа',
        [ 'asia' ],
        'kh',
        '855'
    ],
    [
        'Камерун',
        [ 'africa' ],
        'cm',
        '237'
    ],
    [
        'Кабо-Верде',
        [ 'africa' ],
        'cv',
        '238'
    ],
    [
        'Карибские острова Нидерланды',
        [ 'america', 'carribean' ],
        'bq',
        '599',
        '',
        1
    ],
    [
        'Каймановы острова',
        [ 'america', 'carribean' ],
        'ky',
        '1345'
    ],
    [
        'Центрально-Африканская Республика',
        [ 'africa' ],
        'cf',
        '236'
    ],
    [
        'Чад',
        [ 'africa' ],
        'td',
        '235'
    ],
    [
        'Чили',
        [ 'america', 'south-america' ],
        'cl',
        '56'
    ],
    [
        'Китай',
        [ 'asia' ],
        'cn',
        '86',
        '+.. ..-.........'
    ],
    [
        'Колумбия',
        [ 'america', 'south-america' ],
        'co',
        '57'
    ],
    [
        'Коморские острова',
        [ 'africa' ],
        'km',
        '269'
    ],
    [
        'Конго',
        [ 'africa' ],
        'cd',
        '243'
    ],
    [
        'Конго',
        [ 'africa' ],
        'cg',
        '242'
    ],
    [
        'Острова Кука',
        [ 'oceania' ],
        'ck',
        '682'
    ],
    [
        'Коста Рика',
        [ 'america', 'central-america' ],
        'cr',
        '506',
        '+... ....-....'
    ],
    [
        'Кот-д’Ивуар',
        [ 'africa' ],
        'ci',
        '225'
    ],
    [
        'Хорватия',
        [ 'europe', 'eu-union', 'ex-yugos' ],
        'hr',
        '385'
    ],
    [
        'Куба',
        [ 'america', 'carribean' ],
        'cu',
        '53'
    ],
    [
        'Кюрасао',
        [ 'america', 'carribean' ],
        'cw',
        '599',
        '',
        0
    ],
    [
        'Кипр',
        [ 'europe', 'eu-union' ],
        'cy',
        '357',
        '+... .. ......'
    ],
    [
        'Республика Чехия',
        [ 'europe', 'eu-union' ],
        'cz',
        '420'
    ],
    [
        'Дания',
        [ 'europe', 'eu-union', 'baltic' ],
        'dk',
        '45',
        '+.. .. .. .. ..'
    ],
    [
        'Джибути',
        [ 'africa' ],
        'dj',
        '253'
    ],
    [
        'Доминика',
        [ 'america', 'carribean' ],
        'dm',
        '1767'
    ],
    [
        'Доминиканская Респблика',
        [ 'america', 'carribean' ],
        'do',
        '1',
        '',
        2, [ '809', '829', '849' ]
    ],
    [
        'Эквадор',
        [ 'america', 'south-america' ],
        'ec',
        '593'
    ],
    [
        'Египет',
        [ 'africa', 'north-africa' ],
        'eg',
        '20'
    ],
    [
        'Сальвадор',
        [ 'america', 'central-america' ],
        'sv',
        '503',
        '+... ....-....'
    ],
    [
        'Экваториальная Гвинея',
        [ 'africa' ],
        'gq',
        '240'
    ],
    [
        'Эритрея',
        [ 'africa' ],
        'er',
        '291'
    ],
    [
        'Эстония',
        [ 'europe', 'eu-union', 'ex-ussr', 'baltic' ],
        'ee',
        '372',
        '+... .... ......'
    ],
    [
        'Эфиопия',
        [ 'africa' ],
        'et',
        '251'
    ],
    [
        'Фолклендские острова',
        [ 'america', 'south-america' ],
        'fk',
        '500'
    ],
    [
        'Фарерские острова',
        [ 'europe' ],
        'fo',
        '298'
    ],
    [
        'Фиджи',
        [ 'oceania' ],
        'fj',
        '679'
    ],
    [
        'Финляндия',
        [ 'europe', 'eu-union', 'baltic' ],
        'fi',
        '358',
        '+... .. ... .. ..'
    ],
    [
        'Франция',
        [ 'europe', 'eu-union' ],
        'fr',
        '33',
        '+.. . .. .. .. ..'
    ],
    [
        'Французская Гвиана',
        [ 'america', 'south-america' ],
        'gf',
        '594'
    ],
    [
        'Французская Полинезия',
        [ 'oceania' ],
        'pf',
        '689'
    ],
    [
        'Габон',
        [ 'africa' ],
        'ga',
        '241'
    ],
    [
        'Гамбия',
        [ 'africa' ],
        'gm',
        '220'
    ],
    [
        'Грузия',
        [ 'asia', 'ex-ussr' ],
        'ge',
        '995'
    ],
    [
        'Германия',
        [ 'europe', 'eu-union', 'baltic' ],
        'de',
        '49',
        '+.. .... ........'
    ],
    [
        'Гана',
        [ 'africa' ],
        'gh',
        '233'
    ],
    [
        'Гибралтар',
        [ 'europe' ],
        'gi',
        '350'
    ],
    [
        'Греция',
        [ 'europe', 'eu-union' ],
        'gr',
        '30'
    ],
    [
        'Гренландия',
        [ 'america' ],
        'gl',
        '299'
    ],
    [
        'Гренада',
        [ 'america', 'carribean' ],
        'gd',
        '1473'
    ],
    [
        'Гваделупа',
        [ 'america', 'carribean' ],
        'gp',
        '590',
        '',
        0
    ],
    [
        'Гуам',
        [ 'oceania' ],
        'gu',
        '1671'
    ],
    [
        'Гватемала',
        [ 'america', 'central-america' ],
        'gt',
        '502',
        '+... ....-....'
    ],
    [
        'Гвинея',
        [ 'africa' ],
        'gn',
        '224'
    ],
    [
        'Гвинея-Бисау',
        [ 'africa' ],
        'gw',
        '245'
    ],
    [
        'Гайана',
        [ 'america', 'south-america' ],
        'gy',
        '592'
    ],
    [
        'Гаити',
        [ 'america', 'carribean' ],
        'ht',
        '509',
        '+... ....-....'
    ],
    [
        'Гондурас',
        [ 'america', 'central-america' ],
        'hn',
        '504'
    ],
    [
        'Гонконг',
        [ 'asia' ],
        'hk',
        '852',
        '+... .... ....'
    ],
    [
        'Венгрия',
        [ 'europe', 'eu-union' ],
        'hu',
        '36'
    ],
    [
        'Исландия',
        [ 'europe' ],
        'is',
        '354',
        '+... ... ....'
    ],
    [
        'Индия',
        [ 'asia' ],
        'in',
        '91',
        '+.. .....-.....'
    ],
    [
        'Индонезия',
        [ 'asia' ],
        'id',
        '62'
    ],
    // [
    //     'Iran',
    //     [ 'middle-east' ],
    //     'ir',
    //     '98'
    // ],
    [
        'Ирак',
        [ 'middle-east' ],
        'iq',
        '964'
    ],
    [
        'Ирландия',
        [ 'europe', 'eu-union' ],
        'ie',
        '353',
        '+... .. .......'
    ],
    [
        'Израиль',
        [ 'middle-east' ],
        'il',
        '972',
        '+... ... ... ....'
    ],
    [
        'Италия',
        [ 'europe', 'eu-union' ],
        'it',
        '39',
        '+.. ... .......',
        0
    ],
    [
        'Ямайка',
        [ 'america', 'carribean' ],
        'jm',
        '1876'
    ],
    [
        'Япония',
        [ 'asia' ],
        'jp',
        '81',
        '+.. .. .... ....'
    ],
    [
        'Иордания',
        [ 'middle-east' ],
        'jo',
        '962'
    ],
    [
        'Казахстан',
        [ 'asia', 'ex-ussr' ],
        'kz',
        '7',
        '+. ... ...-..-..',
        1, [ '310', '311', '312', '313', '315', '318', '321', '324', '325', '326', '327', '336', '7172', '73622' ]
    ],
    [
        'Кения',
        [ 'africa' ],
        'ke',
        '254'
    ],
    [
        'Кирибати',
        [ 'oceania' ],
        'ki',
        '686'
    ],
    [
        'Косово',
        [ 'europe', 'ex-yugos' ],
        'xk',
        '383'
    ],
    [
        'Кувейт',
        [ 'middle-east' ],
        'kw',
        '965'
    ],
    [
        'Киргизия',
        [ 'asia', 'ex-ussr' ],
        'kg',
        '996'
    ],
    [
        'Лаос',
        [ 'asia' ],
        'la',
        '856'
    ],
    [
        'Латвия',
        [ 'europe', 'eu-union', 'ex-ussr', 'baltic' ],
        'lv',
        '371'
    ],
    [
        'Ливан',
        [ 'middle-east' ],
        'lb',
        '961'
    ],
    [
        'Лесото',
        [ 'africa' ],
        'ls',
        '266'
    ],
    [
        'Либерия',
        [ 'africa' ],
        'lr',
        '231'
    ],
    [
        'Ливия',
        [ 'africa', 'north-africa' ],
        'ly',
        '218'
    ],
    [
        'Лихтенштейн',
        [ 'europe' ],
        'li',
        '423'
    ],
    [
        'Литва',
        [ 'europe', 'eu-union', 'ex-ussr', 'baltic' ],
        'lt',
        '370'
    ],
    [
        'Люксембург',
        [ 'europe', 'eu-union' ],
        'lu',
        '352'
    ],
    [
        'Макао',
        [ 'asia' ],
        'mo',
        '853'
    ],
    [
        'Македония',
        [ 'europe', 'ex-yugos' ],
        'mk',
        '389'
    ],
    [
        'Мадагаскар',
        [ 'africa' ],
        'mg',
        '261'
    ],
    [
        'Малави',
        [ 'africa' ],
        'mw',
        '265'
    ],
    [
        'Малайзия',
        [ 'asia' ],
        'my',
        '60',
        '+.. ..-....-....'
    ],
    [
        'Мальдивы',
        [ 'asia' ],
        'mv',
        '960'
    ],
    [
        'Мали',
        [ 'africa' ],
        'ml',
        '223'
    ],
    [
        'Мальта',
        [ 'europe', 'eu-union' ],
        'mt',
        '356'
    ],
    [
        'Маршалловы острова',
        [ 'oceania' ],
        'mh',
        '692'
    ],
    [
        'Мартиника',
        [ 'america', 'carribean' ],
        'mq',
        '596'
    ],
    [
        'Мавритания',
        [ 'africa' ],
        'mr',
        '222'
    ],
    [
        'Маврикий',
        [ 'africa' ],
        'mu',
        '230'
    ],
    [
        'Мексика',
        [ 'america', 'central-america' ],
        'mx',
        '52'
    ],
    [
        'Микронезия',
        [ 'oceania' ],
        'fm',
        '691'
    ],
    [
        'Молдова',
        [ 'europe' ],
        'md',
        '373',
        '+... (..) ..-..-..'
    ],
    [
        'Монако',
        [ 'europe' ],
        'mc',
        '377'
    ],
    [
        'Монголия',
        [ 'asia' ],
        'mn',
        '976'
    ],
    [
        'Черногория',
        [ 'europe', 'ex-yugos' ],
        'me',
        '382'
    ],
    [
        'Монсеррат',
        [ 'america', 'carribean' ],
        'ms',
        '1664'
    ],
    [
        'Марокко',
        [ 'africa', 'north-africa' ],
        'ma',
        '212'
    ],
    [
        'Мозамбик',
        [ 'africa' ],
        'mz',
        '258'
    ],
    [
        'Мьянма',
        [ 'asia' ],
        'mm',
        '95'
    ],
    [
        'Намибия',
        [ 'africa' ],
        'na',
        '264'
    ],
    [
        'Науру',
        [ 'africa' ],
        'nr',
        '674'
    ],
    [
        'Непал',
        [ 'asia' ],
        'np',
        '977'
    ],
    [
        'Нидерланды',
        [ 'europe', 'eu-union' ],
        'nl',
        '31',
        '+.. .. ........'
    ],
    [
        'Новая Каледония',
        [ 'oceania' ],
        'nc',
        '687'
    ],
    [
        'Новая Зеландия',
        [ 'oceania' ],
        'nz',
        '64',
        '+.. ...-...-....'
    ],
    [
        'Никарагуа',
        [ 'america', 'central-america' ],
        'ni',
        '505'
    ],
    [
        'Нигер',
        [ 'africa' ],
        'ne',
        '227'
    ],
    [
        'Нигерия',
        [ 'africa' ],
        'ng',
        '234'
    ],
    // [
    //     'Niue',
    //     [ 'asia' ],
    //     'nu',
    //     '683'
    // ],
    [
        'Остров Норфолк',
        [ 'oceania' ],
        'nf',
        '672'
    ],
    [
        'Северная Корея',
        [ 'asia' ],
        'kp',
        '850'
    ],
    [
        'Северные Марианские острова',
        [ 'oceania' ],
        'mp',
        '1670'
    ],
    [
        'Норвегия',
        [ 'europe', 'baltic' ],
        'no',
        '47',
        '+.. ... .. ...'
    ],
    [
        'Оман',
        [ 'middle-east' ],
        'om',
        '968'
    ],
    [
        'Пакистан',
        [ 'asia' ],
        'pk',
        '92',
        '+.. ...-.......'
    ],
    // [
    //     'Palau',
    //     [ 'oceania' ],
    //     'pw',
    //     '680'
    // ],
    [
        'Палестина',
        [ 'middle-east' ],
        'ps',
        '970'
    ],
    [
        'Панама',
        [ 'america', 'central-america' ],
        'pa',
        '507'
    ],
    [
        'Папуа - Новая Гвинея',
        [ 'oceania' ],
        'pg',
        '675'
    ],
    [
        'Парагвай',
        [ 'america', 'south-america' ],
        'py',
        '595'
    ],
    [
        'Перу',
        [ 'america', 'south-america' ],
        'pe',
        '51'
    ],
    [
        'Филиппины',
        [ 'asia' ],
        'ph',
        '63',
        '+.. .... .......'
    ],
    [
        'Польша',
        [ 'europe', 'eu-union', 'baltic' ],
        'pl',
        '48',
        '+.. ...-...-...'
    ],
    [
        'Португалия',
        [ 'europe', 'eu-union' ],
        'pt',
        '351'
    ],
    [
        'Пуэрто-Рико',
        [ 'america', 'carribean' ],
        'pr',
        '1',
        '',
        3, [ '787', '939' ]
    ],
    [
        'Катар',
        [ 'middle-east' ],
        'qa',
        '974'
    ],
    [
        'Реюньон',
        [ 'africa' ],
        're',
        '262'
    ],
    [
        'Румыния',
        [ 'europe', 'eu-union' ],
        'ro',
        '40'
    ],
    [
        'Россия',
        [ 'europe', 'asia', 'ex-ussr', 'baltic' ],
        'ru',
        '7',
        '+. (...) ...-..-..',
        0
    ],
    [
        'Руанда',
        [ 'africa' ],
        'rw',
        '250'
    ],
    [
        'Святой Бартелеми',
        [ 'america', 'carribean' ],
        'bl',
        '590',
        '',
        1
    ],
    [
        'Остров Святой Елены',
        [ 'africa' ],
        'sh',
        '290'
    ],
    [
        'Сент-Китс и Невис',
        [ 'america', 'carribean' ],
        'kn',
        '1869'
    ],
    [
        'Сент-Люсия',
        [ 'america', 'carribean' ],
        'lc',
        '1758'
    ],
    [
        'Святой Мартин',
        [ 'america', 'carribean' ],
        'mf',
        '590',
        '',
        2
    ],
    [
        'Сен-Пьер и Микелон',
        [ 'america', 'north-america' ],
        'pm',
        '508'
    ],
    // [
    //     'Святой Винсент и Гренадины',
    //     [ 'america', 'carribean' ],
    //     'vc',
    //     '1784'
    // ],
    [
        'Самоа',
        [ 'oceania' ],
        'ws',
        '685'
    ],
    [
        'Сан-Марино',
        [ 'europe' ],
        'sm',
        '378'
    ],
    [
        'Сан-Томе и Принсипи',
        [ 'africa' ],
        'st',
        '239'
    ],
    [
        'Саудовская Аравия',
        [ 'middle-east' ],
        'sa',
        '966'
    ],
    [
        'Сенегал',
        [ 'africa' ],
        'sn',
        '221'
    ],
    [
        'Сербия',
        [ 'europe', 'ex-yugos' ],
        'rs',
        '381'
    ],
    [
        'Сейшельские острова',
        [ 'africa' ],
        'sc',
        '248'
    ],
    [
        'Сьерра-Леоне',
        [ 'africa' ],
        'sl',
        '232'
    ],
    [
        'Сингапур',
        [ 'asia' ],
        'sg',
        '65',
        '+.. ....-....'
    ],
    [
        'Синт-Мартен',
        [ 'america', 'carribean' ],
        'sx',
        '1721'
    ],
    [
        'Словакия',
        [ 'europe', 'eu-union' ],
        'sk',
        '421'
    ],
    [
        'Словения',
        [ 'europe', 'eu-union', 'ex-yugos' ],
        'si',
        '386'
    ],
    [
        'Соломоновы острова',
        [ 'oceania' ],
        'sb',
        '677'
    ],
    [
        'Сомали',
        [ 'africa' ],
        'so',
        '252'
    ],
    [
        'Южная Африка',
        [ 'africa' ],
        'za',
        '27'
    ],
    [
        'Южная Корея',
        [ 'asia' ],
        'kr',
        '82',
        '+.. ... .... ....'
    ],
    [
        'Южный Судан',
        [ 'africa', 'north-africa' ],
        'ss',
        '211'
    ],
    [
        'Испания',
        [ 'europe', 'eu-union' ],
        'es',
        '34',
        '+.. ... ... ...'
    ],
    [
        'Шри-Ланка',
        [ 'asia' ],
        'lk',
        '94'
    ],
    [
        'Судан',
        [ 'africa' ],
        'sd',
        '249'
    ],
    [
        'Суринам',
        [ 'america', 'south-america' ],
        'sr',
        '597'
    ],
    [
        'Свазиленд',
        [ 'africa' ],
        'sz',
        '268'
    ],
    [
        'Швеция',
        [ 'europe', 'eu-union', 'baltic' ],
        'se',
        '46',
        '+.. (...) ...-...'
    ],
    [
        'Швейцария',
        [ 'europe' ],
        'ch',
        '41',
        '+.. .. ... .. ..'
    ],
    [
        'Сирия',
        [ 'middle-east' ],
        'sy',
        '963'
    ],
    [
        'Тайвань',
        [ 'asia' ],
        'tw',
        '886'
    ],
    [
        'Таджикистан',
        [ 'asia', 'ex-ussr' ],
        'tj',
        '992'
    ],
    [
        'Танзания',
        [ 'africa' ],
        'tz',
        '255'
    ],
    [
        'Таиланд',
        [ 'asia' ],
        'th',
        '66'
    ],
    [
        'Восточный Тимор',
        [ 'asia' ],
        'tl',
        '670'
    ],
    [
        'Идти',
        [ 'africa' ],
        'tg',
        '228'
    ],
    [
        'Токелау',
        [ 'oceania' ],
        'tk',
        '690'
    ],
    [
        'Тонга',
        [ 'oceania' ],
        'to',
        '676'
    ],
    [
        'Тринидад и Тобаго',
        [ 'america', 'carribean' ],
        'tt',
        '1868'
    ],
    [
        'Тунис',
        [ 'africa', 'north-africa' ],
        'tn',
        '216'
    ],
    [
        'Турция',
        [ 'europe' ],
        'tr',
        '90',
        '+.. ... ... .. ..'
    ],
    [
        'Туркменистан',
        [ 'asia', 'ex-ussr' ],
        'tm',
        '993'
    ],
    [
        'Острова Теркс и Кайкос',
        [ 'america', 'carribean' ],
        'tc',
        '1649'
    ],
    [
        'Тувалу',
        [ 'asia' ],
        'tv',
        '688'
    ],
    [
        'Виргинские острова США',
        [ 'america', 'carribean' ],
        'vi',
        '1340'
    ],
    [
        'Уганда',
        [ 'africa' ],
        'ug',
        '256'
    ],
    [
        'Украина',
        [ 'europe', 'ex-ussr' ],
        'ua',
        '380',
        '+... (..) ... .. ..'
    ],
    [
        'Объединённые Арабские Эмираты',
        [ 'middle-east' ],
        'ae',
        '971'
    ],
    [
        'Уругвай',
        [ 'america', 'south-america' ],
        'uy',
        '598'
    ],
    [
        'Узбекистан',
        [ 'asia', 'ex-ussr' ],
        'uz',
        '998'
    ],
    [
        'Вануату',
        [ 'oceania' ],
        'vu',
        '678'
    ],
    [
        'Ватикан',
        [ 'europe' ],
        'va',
        '39',
        '+.. .. .... ....',
        1
    ],
    [
        'Венесуэла',
        [ 'america', 'south-america' ],
        've',
        '58'
    ],
    [
        'Вьетнам',
        [ 'asia' ],
        'vn',
        '84'
    ],
    [
        'Уоллис и Футуна',
        [ 'oceania' ],
        'wf',
        '681'
    ],
    [
        'Йемен',
        [ 'middle-east' ],
        'ye',
        '967'
    ],
    [
        'Замбия',
        [ 'africa' ],
        'zm',
        '260'
    ],
    [
        'Зимбабве',
        [ 'africa' ],
        'zw',
        '263'
    ]
];

export default rawCountries;
